print('Вы не верите в чудеса? А они случаются! Проверим? \n Какое бы число Вы не ввели, ряд следующих арифметических операций превратит в конце концов это число в 4')
num = int(input('Например, число: '))
num1 = num*2
print('Число ', num, ', умноженное на 2, равно ', num1)
num2 = num1+8
print('Число ', num1, ', к которому прибавили 8, равно ', num2)
num3 = num2//2
print('Число ', num2, ', разделённое на 2, равно ', num3)
number = num3-num
print('Число ', num3, ', от которого отняли загаданное число ', num, ', равно...', '\n', '...барабанная дробь...', '\n', number, ' !')
print('Вы всё ещё не верите в чудеса?..')
print('Спасибо за внимание!..')
